def get_info_adv_root(root):
    if root in adv_words or adv_kosh_words:
        return "adv"
    else:
        return "none"
def get_info_adv_ending(ending):
    if ending in adv_ending:
        return "adv"
    else:
        return "none"
adv_words = {
    'бүгүн','былтыр','быйыл','небак','эчак','өгүнү','бүрсүгүнү','жаңы','эбак','эртең','башта','бая','кечээ','мурдагүнү',
    'ылдам','жай','бат','тез','кеч','аздыр','жогору','илгери','киймн','ары','бери','эрте','дал','дароо','чап',
    'чапчаң','эми','дайыма','илгери','тескери','күздөй','жаздай','жайлай','кыштай','күздү-күздөй','кышты-кыштай',
    'жазды-жаздай','жайды-жайлай','акчалай','эгиндей','утурлай','ылдамдай','бекерге','алга','күчкө','зорго',
    'жылыга','күнүгө','кээде','алда','мурда','күндө','эзелде','кокустан','азыртан','абалтан','эзелтен',
    'эмитен','жанатан','кийин','акырын','тымызын','күнүн','түнүн','кышын','жазын','жайын','күзүн','эртеден','мурдатан',
    'баштатан','арытан','беритен','беритеден','арытадан','ыкчам','күнгө','бекерге','түштө','мында','кээде','өйдө',
    'илгертен','кокустан','эмитен','мурунтан','азыртан','кечкурун','төмөн','белен','илгертеден','ичкертеден',
    'жогортон','жогортодон','азыр','анан','баягүнү','капкачан','андан','кечке','дайым','эртеңдерден','бүрсүгүндөрдөн',
    'аргасыздан','эрксизден','жиндиликтен','атайын','атайлап','мында',
    'акырын','аста','адамча','айбанча','тымызын','бирге','каадасынча','адатынча','мурункусунча','кайра','кайта','жайбаракат',
    'бачым','барынча','саал','ушунчалык','ошончолук'
}
adv_ending = {
        'ча','че','ша','ше','чө',   #кыргызча
        'лап','леп','теп','деп','дап','тап','дөп','төп','тап',  #айлап
        'чылап','чилеп','чалап',
        'дай','тай','дой','дөй','дей','той','төй','тей','лай',  #акчалай
        'лата','дете',  #
        'чалык','чолук','чөлүк','челик',    #ушунчалык
        'сын','син','сүн',  #кышкысын
        #'ындасы','дөсү','индеси','үндөсү', #- диалект сөздөр (кышындасы)
        'ата',
        'та'
}
adv_mini_words = {
    'бир','ар','эч' #бир күнү, бир паста, ар дайым, эч качан
}
adv_kosh_words = {
    'кайра-кайра','тез-тез','бат-бат','алыс-алыс','илгери-илгери','кез-кез','ылдам-ылдам','мурда-мурда',
    'сүйлөй-сүйлөй','кезек-кезек','каптап-каптап','кайра-кайра','өйдө-ылдый','чогуу-чаран','ары-бери',
    'өйдө-төмөн','илгери-кийин','олбуй-солбуй','астын-үстүн','чогуу-чаран','эртели-кеч','жайы-кышы','оңду-солду',
    'кез-кезде','аз-аздан','бат-баттан','топ-топтон','анда-санда','андан-мындан','ойдон-тоодон',
    'кээде-кээде','күндө-күндө','анда-мында',
    'оозмо-ооз','көзмө-көз','бетме-бет','жекеме-жеке','колмо-кол','айылма-айыл','жүзмө-жүз','шаарма-шаар','түтүнмө-түнүн',
    'эртедир-кечтир','күндүр-түндүр','жайдыр-кыштыр','катар-катар','ачык-айкын','соо-саламат',
    'аман-эсен','бара-бара','ала-сала','кайта-кайта','бүгүн-эртең','эртең-бүрсүгүндөрдөн',
    'ачыктан-ачык','ээн-эркин','аста-секин','үстү-үстүнө','улам-улам','үстөкө-босток','кайта-кайта','уйгу-туйгу',
    'алка-шалка','абыр-шыбыр','ыйкы-тыйкы','ачыктан-ачык','аз-маз','аз-аздан','бир-бирден','көп-көптөн','араң-араң',
    'ээн-эркин'
}